# Core package management
brew "bash"
brew "bat"
brew "coreutils"
brew "curl"
brew "deno"
brew "doctl"
brew "elixir"
brew "erlang"
brew "executor"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "git-secrets"
brew "gleam"
brew "go"
brew "jq"
brew "llvm@20"
brew "mkcert"
brew "ngrok"
brew "node"
brew "ollama"
brew "python"
brew "ripgrep"
brew "rustup"
brew "sqlite"
brew "wget"
brew "eza"

# Container / k8s tooling (provided by OrbStack too)
brew "kubectl"

# GUI apps / casks
cask "db-browser-for-sqlite"
cask "font-monaspace"
cask "hstracker"
cask "leader-key"
cask "mitmproxy"
cask "ngrok"
cask "only-switch"
cask "orbstack"
