# ── Core CLI Tools ──────────────────────────
brew "bash"
brew "bat"
brew "coreutils"
brew "curl"
brew "doctl"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-secrets"
brew "jq"
brew "mkcert"
brew "ollama"
brew "ripgrep"
brew "sqlite"
brew "wget"
brew "eza"

# ── Runtimes ────────────────────────────────
brew "deno"
brew "go"
brew "node"
brew "python"
brew "rustup"

# ── Dev Tools ───────────────────────────────

# ── GUI: Development ────────────────────────
cask "ghostty"
cask "visual-studio-code"
cask "zed"

# ── GUI: Browsers ───────────────────────────
cask "google-chrome"

# ── GUI: Productivity ───────────────────────
cask "rectangle"
cask "spotify"
cask "cleanshot"

# ── GUI: Communication ──────────────────────
cask "discord"
cask "slack"
cask "whatsapp"
cask "zoom"

# ── GUI: Utilities ──────────────────────────
cask "db-browser-for-sqlite"
cask "font-monaspace"
cask "mitmproxy"
cask "only-switch"
cask "orbstack"
